---
kind: method
id: M:Autodesk.Revit.DB.PointCloudInstance.HasColor
source: html/55cdf3f1-02a5-499f-99a4-97ae92f07c43.htm
---
# Autodesk.Revit.DB.PointCloudInstance.HasColor Method

Returns true if at least one scan of the element have color, false otherwise.

## Syntax (C#)
```csharp
public bool HasColor()
```

## Returns
True if at least one scan of the element have color, false otherwise.